RomanLut/hx-esp32-cam-fpv/components/esp32-camera/sensors/ov5640.c
    if(!pll_sys_div) {
        pll_sys_div = 1;
    }

    float pll_pre_div = pll_pre_div2x_map[pre_div];
    unsigned int REFIN = xclk / pll_pre_div;
    unsigned int root_2x_div = root_2x?2:1;
    unsigned int VCO = REFIN * pll_multiplier / root_2x_div;
    unsigned int PLL_CLK = pll_bypass?(xclk):(VCO / pll_sys_div * 2 / 5);//5 here is 10bit mode / 2, for 8bit it should be 4 (reg 0x3034)
    unsigned int SYSCLK = PLL_CLK / 4;

    //unsigned int pll_pclk_root_div = pll_pclk_root_div_map[pclk_root_div];
    //unsigned int PCLK = PLL_CLK / pll_pclk_root_div / ((pclk_manual && pclk_div)?pclk_div:2);

    //ESP_LOGI(TAG, "Calculated XVCLK: %d Hz, REFIN: %u Hz, VCO: %u Hz, PLL_CLK: %u Hz, SYSCLK: %u Hz, PCLK: %u Hz", xclk, REFIN, VCO, PLL_CLK, SYSCLK, PCLK);
    return SYSCLK;
}

static int set_pll(sensor_t *sensor, bool bypass, uint8_t multiplier, uint8_t sys_div, uint8_t pre_div, bool root_2x, uint8_t pclk_root_div, bool pclk_manual, uint8_t pclk_div){
    int ret = 0;
    if(multiplier > 252 || multiplier < 4 || sys_div > 15 || pre_div > 8 || pclk_div > 31 || pclk_root_div > 3){
        ESP_LOGE(TAG, "Invalid arguments");
        return -1;
    }
    if(multiplier > 127){
        multiplier &= 0xFE;//only even integers above 127
    }
    //ESP_LOGI(TAG, "Set PLL: bypass: %u, multiplier: %u, sys_div: %u, pre_div: %u, root_2x: %u, pclk_root_div: %u, pclk_manual: %u, pclk_div: %u", bypass, multiplier, sys_div, pre_div, root_2x, pclk_root_div, pclk_manual, pclk_div);

    s_sysclk = calc_sysclk(sensor->xclk_freq_hz, bypass, multiplier, sys_div, pre_div, root_2x, pclk_root_div, pclk_manual, pclk_div);

    ret = write_reg(sensor->slv_addr, 0x3039, bypass?0x80:0x00);
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3034, 0x1A);//10bit mode
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3035, 0x01 | ((sys_div & 0x0f) << 4));
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3036, multiplier & 0xff);
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3037, (pre_div & 0xf) | (root_2x?0x10:0x00));
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3108, (pclk_root_div & 0x3) << 4 | 0x06);
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3824, pclk_div & 0x1f);
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x460C, pclk_manual?0x22:0x20);
    }
    if (ret == 0) {
        ret = write_reg(sensor->slv_addr, 0x3103, 0x13);// system clock from pll, bit[1]
    }
    if(ret){
        ESP_LOGE(TAG, "set_sensor_pll FAILED!");
    }
    return ret;
}

//The AEC banding filter steps and the max exposure limits are counted in lines, so they depend on
//SYSCLK, HTS and VTS. ov5640_settings.h programs constants that only hold for a single mode, which
//leaves anti-banding mis-calibrated for every other resolution and PLL setting. Recompute them
//whenever the frame timing or the PLL changes.
static int set_banding_filter(sensor_t *sensor, unsigned int sysclk, uint16_t hts, uint16_t vts)
{
    if (sysclk == 0 || hts == 0 || vts <= 4) {
        ESP_LOGE(TAG, "Invalid banding filter arguments");
        return -1;
    }

    uint16_t max_exposure = vts - 4;
    unsigned int band_step_50 = sysclk / (hts * 100u); //lines integrated in 1/100 s
    unsigned int band_step_60 = sysclk / (hts * 120u); //lines integrated in 1/120 s
    if (band_step_50 == 0 || band_step_60 == 0) {
        ESP_LOGE(TAG, "Banding filter step underflow");
        return -1;
    }

    unsigned int max_band_50 = max_exposure / band_step_50;
    unsigned int max_band_60 = max_exposure / band_step_60;
    if (max_band_50 < 1) max_band_50 = 1;
    if (max_band_60 < 1) max_band_60 = 1;
    if (max_band_50 > 255) max_band_50 = 255;
    if (max_band_60 > 255) max_band_60 = 255;

    int ret = write_reg(sensor->slv_addr, 0x3a02, max_exposure >> 8)          //60Hz max exposure
           || write_reg(sensor->slv_addr, 0x3a03, max_exposure & 0xff)
           || write_reg(sensor->slv_addr, 0x3a14, max_exposure >> 8)          //50Hz max exposure
           || write_reg(sensor->slv_addr, 0x3a15, max_exposure & 0xff)
           || write_reg(sensor->slv_addr, 0x3a08, (band_step_50 >> 8) & 0xff) //50Hz band step
           || write_reg(sensor->slv_addr, 0x3a09, band_step_50 & 0xff)
           || write_reg(sensor->slv_addr, 0x3a0a, (band_step_60 >> 8) & 0xff) //60Hz band step
           || write_reg(sensor->slv_addr, 0x3a0b, band_step_60 & 0xff)
           || write_reg(sensor->slv_addr, 0x3a0d, max_band_60)
           || write_reg(sensor->slv_addr, 0x3a0e, max_band_50);

    if (ret) {
        ESP_LOGE(TAG, "set_banding_filter FAILED!");
    }
    return ret;
}

static int set_ae_level(sensor_t *sensor, int level);

static int reset(sensor_t *sensor)
{
    //dump_regs(sensor);
    vTaskDelay(100 / portTICK_PERIOD_MS);
    int ret = 0;
    // Software Reset: clear all registers and reset them to their default values
    ret = write_reg(sensor->slv_addr, SYSTEM_CTROL0, 0x82);
    if(ret){
        ESP_LOGE(TAG, "Software Reset FAILED!");
        return ret;
    }
    vTaskDelay(100 / portTICK_PERIOD_MS);
    ret = write_regs(sensor->slv_addr, sensor_default_regs);
    if (ret == 0) {
        ESP_LOGD(TAG, "Camera defaults loaded");
        vTaskDelay(100 / portTICK_PERIOD_MS);
        //write_regs(sensor->slv_addr, sensor_regs_awb0);
        //write_regs(sensor->slv_addr, sensor_regs_gamma1);
    }
    return ret;
}

static int set_pixformat(sensor_t *sensor, pixformat_t pixformat)
{
    int ret = 0;
    const uint16_t (*regs)[2];

    switch (pixformat) {
    case PIXFORMAT_YUV422:
        regs = sensor_fmt_yuv422;
        break;

    case PIXFORMAT_GRAYSCALE:
        regs = sensor_fmt_grayscale;
        break;

    case PIXFORMAT_RGB565:
    case PIXFORMAT_RGB888:
        regs = sensor_fmt_rgb565;
        break;

    case PIXFORMAT_JPEG:
        regs = sensor_fmt_jpeg;
        break;

    case PIXFORMAT_RAW:
        regs = sensor_fmt_raw;
        break;

    default:
        ESP_LOGE(TAG, "Unsupported pixformat: %u", pixformat);
        return -1;
    }

    ret = write_regs(sensor->slv_addr, regs);
    if(ret == 0) {
        sensor->pixformat = pixformat;
        ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
    }
    return ret;
}

static int set_image_options(sensor_t *sensor)
{
    int ret = 0;
    uint8_t reg20 = 0;
    uint8_t reg21 = 0;
    uint8_t reg4514 = 0;
    uint8_t reg4514_test = 0;

