RomanLut/hx-esp32-cam-fpv/components/esp32-camera/sensors/ov5640.c
    // compression
    if (sensor->pixformat == PIXFORMAT_JPEG) {
        reg21 |= 0x20; 
    }

    // binning
    if (!sensor->status.binning) {
        reg20 |= 0x40;
    } else {
        reg20 |= 0x01;
        reg21 |= 0x01;
        reg4514_test |= 4;
    }

    // V-Flip
    if (sensor->status.vflip) {
        reg20 |= 0x06;
        reg4514_test |= 1;
    }

    // H-Mirror
    if (!sensor->status.hmirror) {
        reg21 |= 0x06;
        reg4514_test |= 2;
    }

    switch (reg4514_test) {
        //no binning
        case 0: reg4514 = 0x88; break;//normal
        case 1: reg4514 = 0x00; break;//v-flip
        case 2: reg4514 = 0xbb; break;//h-mirror
        case 3: reg4514 = 0x00; break;//v-flip+h-mirror
        //binning
        case 4: reg4514 = 0xaa; break;//normal
        case 5: reg4514 = 0xbb; break;//v-flip
        case 6: reg4514 = 0xbb; break;//h-mirror
        case 7: reg4514 = 0xaa; break;//v-flip+h-mirror
    }

    if(write_reg(sensor->slv_addr, TIMING_TC_REG20, reg20)
        || write_reg(sensor->slv_addr, TIMING_TC_REG21, reg21)
        || write_reg(sensor->slv_addr, 0x4514, reg4514)){
        ESP_LOGE(TAG, "Setting Image Options Failed");
        return -1;
    }

    if (!sensor->status.binning) {
        ret  = write_reg(sensor->slv_addr, 0x4520, 0x10)
            || write_reg(sensor->slv_addr, X_INCREMENT, 0x11)//odd:1, even: 1
            || write_reg(sensor->slv_addr, Y_INCREMENT, 0x11);//odd:1, even: 1
    } else {
        ret  = write_reg(sensor->slv_addr, 0x4520, 0x0b)
            || write_reg(sensor->slv_addr, X_INCREMENT, 0x31)//odd:3, even: 1
            || write_reg(sensor->slv_addr, Y_INCREMENT, 0x31);//odd:3, even: 1
    }

    ESP_LOGD(TAG, "Set Image Options: Compression: %u, Binning: %u, V-Flip: %u, H-Mirror: %u, Reg-4514: 0x%02x",
        sensor->pixformat == PIXFORMAT_JPEG, sensor->status.binning, sensor->status.vflip, sensor->status.hmirror, reg4514);
    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    int ret = 0;
    framesize_t old_framesize = sensor->status.framesize;
    sensor->status.framesize = framesize;

    if(framesize > FRAMESIZE_QSXGA){
        ESP_LOGE(TAG, "Invalid framesize: %u", framesize);
        return -1;
    }
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    aspect_ratio_t ratio = resolution[framesize].aspect_ratio;
    ratio_settings_t settings = ratio_table[ratio];

    sensor->status.binning = (w <= (settings.max_width / 2) && h <= (settings.max_height / 2));
    sensor->status.scale = !((w == settings.max_width && h == settings.max_height)
        || (w == (settings.max_width / 2) && h == (settings.max_height / 2)));

    ret  = write_addr_reg(sensor->slv_addr, X_ADDR_ST_H, settings.start_x, settings.start_y)
        || write_addr_reg(sensor->slv_addr, X_ADDR_END_H, settings.end_x, settings.end_y)
        || write_addr_reg(sensor->slv_addr, X_OUTPUT_SIZE_H, w, h);

    if (ret) {
        goto fail;
    }

    uint16_t hts;
    uint16_t vts;

    if (!sensor->status.binning) {
        hts = settings.total_x;
        vts = settings.total_y;
        ret  = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, settings.total_x, settings.total_y)
            || write_addr_reg(sensor->slv_addr, X_OFFSET_H, settings.offset_x, settings.offset_y);
    } else {
        hts = (w > 920) ? (settings.total_x - 200) : 2060;
        vts = settings.total_y / 2;
        ret = write_addr_reg(sensor->slv_addr, X_TOTAL_SIZE_H, hts, vts);
        if (ret == 0) {
            ret = write_addr_reg(sensor->slv_addr, X_OFFSET_H, settings.offset_x / 2, settings.offset_y / 2);
        }
    }

    if (ret == 0) {
        ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x20, sensor->status.scale);
    }

    if (ret == 0) {
        ret = set_image_options(sensor);
    }

    if (ret) {
        goto fail;
    }

    if (sensor->pixformat == PIXFORMAT_JPEG) {
//#if defined(CONFIG_IDF_TARGET_ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32C5)
#ifdef CONFIG_IDF_TARGET_ESP32S3 
        /*
        //10MHz PCLK
        uint8_t sys_mul = 200;
        if(framesize < FRAMESIZE_QVGA || sensor->xclk_freq_hz == 16000000){
            sys_mul = 160;
        } else if(framesize < FRAMESIZE_XGA){
            sys_mul = 180;
        }
        ret = set_pll(sensor, false, sys_mul, 4, 2, false, 2, true, 4);
        Set PLL: bypass: 0, multiplier: sys_mul, sys_div: 4, pre_div: 2, root_2x: 0, pclk_root_div: 2, pclk_manual: 1, pclk_div: 4
        */


        //https://patchwork.kernel.org/project/linux-media/patch/20181113130325.28975-2-maxime.ripard@bootlin.com/

        //for XLCK=20Mhz
        if (framesize == FRAMESIZE_SVGA ) //800x600
        {
            ret = set_pll(sensor, false, 91, 1, 3, false, 2, true, 3); //20.22 mhz pclk 29.9 FPS
        }
        else if (framesize == FRAMESIZE_P_HD) //800x456
        {
            if (sensor->status.colorbar == 0 )
            {
                ret = set_pll(sensor, false, 46, 2, 1, false, 2, true, 3); //15.33 mhz pclk 30.0 FPS
            }
            else
            {
                ret = set_pll(sensor, false, 77, 1, 2, false, 2, true, 4); //19.25 mhz pclk 50.2 FPS
            }
        }
        else if (framesize == FRAMESIZE_VGA) //640x480
        {
            if (sensor->status.colorbar == 0 )
            {
                ret = set_pll(sensor, false, 91, 1, 3, false, 2, true, 3); //20.22 mhz pclk 29.9 FPS
            }
            else
            {
                ret = set_pll(sensor, false, 81, 1, 2, false, 2, true, 4); //20.25 mhz pclk 40.0 FPS
            }
        }
        else if (framesize == FRAMESIZE_P_3MP) //640x360
        {
            if (sensor->status.colorbar == 0 )
            {
                ret = set_pll(sensor, false, 46, 2, 1, false, 2, true, 3); //15.33 mhz pclk 30.0 FPS
            }
            else
            {
                ret = set_pll(sensor, false, 77, 1, 2, false, 2, true, 4); //19.25 mhz pclk 50.2 FPS
            }
        }
        else if (framesize == FRAMESIZE_XGA)  //1024x768 
        {
            ret = set_pll(sensor, false, 39, 1, 1, false, 2, true, 5); //15.6 mhz pclk 30.0 FPS
        }
        else if (framesize == FRAMESIZE_P_FHD)  //1024x576 
        {
            ret = set_pll(sensor, false, 59, 1, 2, false, 2, true, 3);  //19.67 mhz pclk 30.0 FPS
        }
        else if (framesize == FRAMESIZE_SXGA)  //1280x960
        {
            ret = set_pll(sensor, false, 39, 1, 1, false, 2, true, 5); //15.6 mhz pclk 30.0 FPS
        }
        else if (framesize == FRAMESIZE_HD)  //1280x720 
        {
            ret = set_pll(sensor, false, 59, 1, 2, false, 2, true, 3);  //19.67 mhz pclk 30.0 FPS
        }
        else 
        {
            //ret = set_pll(sensor, false, 19, 1, 1, false, 3, true, 4); 
            ret = set_pll(sensor, false, 19, 1, 1, false, 2, true, 3); //12.67 mhz pclk 18.7 FPS (4:3 sizes)
        }
#else
        //10MHz PCLK
        uint8_t sys_mul = 200;
        if(framesize < FRAMESIZE_QVGA || sensor->xclk_freq_hz == 16000000){
            sys_mul = 160;
        } else if(framesize < FRAMESIZE_XGA){
            sys_mul = 180;
        }

#if defined(CONFIG_IDF_TARGET_ESP32C5)
        if (sensor->status.colorbar &&
            ((framesize == FRAMESIZE_VGA) || (framesize == FRAMESIZE_P_3MP) || (framesize == FRAMESIZE_P_HD)))
        {
            //high FPS modes (ov5640HighFPS flag, passed via set_colorbar())
            const int high_fps_pll_multiplier = (framesize == FRAMESIZE_VGA) ? 101 : 32;
            const int high_fps_pre_div = (framesize == FRAMESIZE_VGA) ? 3 : 1;
            ret = set_pll(sensor, false, high_fps_pll_multiplier, 1, high_fps_pre_div, false, 2, true, 4); //640x360/800x456: 19.2 mhz pclk 50.1 FPS; 640x480: 20.2 mhz pclk 40.0 FPS
        }
        else
        {
            //VCO (= XCLK / pre_div * sys_mul) must stay within 500..1000 mhz.
            //Scaling pre_div/sys_div together with sys_mul keeps PLL_CLK, and hence SYSCLK/FPS and PCLK, unchanged.
            uint8_t pre_div = 2;
            uint8_t sys_div = 4;
            uint8_t pclk_div = 4;

