RomanLut/hx-esp32-cam-fpv/components/esp32-camera/sensors/ov5640.c
            if (framesize == FRAMESIZE_P_3MP)             //640x360: VCO 924 mhz, 15.4 mhz pclk, 30.1 FPS
            {
                sys_mul = 77;
                sys_div = 2;
                pclk_div = 3;
            }
            else if (framesize == FRAMESIZE_VGA)          //640x480: VCO 606 mhz, 15.15 mhz pclk, 29.9 FPS
            {
                sys_mul = 101;
                pre_div = 4;
                sys_div = 1;
            }
            else if (framesize == FRAMESIZE_SVGA)         //800x600: VCO 606 mhz, 15.15 mhz pclk, 29.9 FPS
            {
                sys_mul = 101;
                pre_div = 4;
                sys_div = 1;
            }
            else if (framesize == FRAMESIZE_P_HD)         //800x456: VCO 924 mhz, 11.55 mhz pclk, 30.1 FPS
            {
                sys_mul = 77;
                sys_div = 2;
            }
            else if (framesize == FRAMESIZE_P_FHD)        //1024x576: VCO 588 mhz, 14.7 mhz pclk, 29.9 FPS
            {
                sys_mul = 98;
                pre_div = 4;
                sys_div = 1;
            }
            else if (framesize == FRAMESIZE_HD)           //1280x720: VCO 588 mhz, 14.7 mhz pclk, 29.9 FPS
            {
                sys_mul = 98;
                pre_div = 4;
                sys_div = 1;
            }
            else                                          //other sizes: VCO 960 mhz, 12.0 mhz pclk
            {
                sys_mul = 80;
                sys_div = 2;
            }

            ret = set_pll(sensor, false, sys_mul, sys_div, pre_div, false, 2, true, pclk_div);
        }
#else
        ret = set_pll(sensor, false, sys_mul, 4, 2, false, 2, true, 4);
        //Set PLL: bypass: 0, multiplier: sys_mul, sys_div: 4, pre_div: 2, root_2x: 0, pclk_root_div: 2, pclk_manual: 1, pclk_div: 4
#endif
#endif
    } else {
        //ret = set_pll(sensor, false, 8, 1, 1, false, 1, true, 4);
        if (framesize > FRAMESIZE_HVGA) {
            ret = set_pll(sensor, false, 10, 1, 2, false, 1, true, 2);
        } else if (framesize >= FRAMESIZE_QVGA) {
            ret = set_pll(sensor, false, 8, 1, 1, false, 1, true, 4);
        } else {
            ret = set_pll(sensor, false, 20, 1, 1, false, 1, true, 8);
        }
    }

    if (ret == 0) {
        ret = set_banding_filter(sensor, s_sysclk, hts, vts);
    }

    if (ret == 0) {
        //A high FPS frame is shorter than two 50Hz banding periods, so the anti-banding filter would
        //quantize the exposure down to a single 10ms band and cost a stop of light. Mains flicker is
        //not a concern outdoors, so disable the filter (AEC_CTRL00 band enable) in the high FPS modes.
        bool high_fps = (sensor->status.colorbar != 0)
            && ((framesize == FRAMESIZE_VGA) || (framesize == FRAMESIZE_P_3MP) || (framesize == FRAMESIZE_P_HD));
        ret = write_reg_bits(sensor->slv_addr, 0x3a00, 0x20, !high_fps);
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    return ret;

fail:
    sensor->status.framesize = old_framesize;
    ESP_LOGE(TAG, "Setting framesize to: %ux%u failed", w, h);
    return ret;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.hmirror = enable;
    ret = set_image_options(sensor);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
    }
    return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.vflip = enable;
    ret = set_image_options(sensor);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set v-flip to: %d", enable);
    }
    return ret;
}

static int set_quality(sensor_t *sensor, int qs)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, COMPRESSION_CTRL07, qs & 0x3f);
    if (ret == 0) {
        sensor->status.quality = qs;
        ESP_LOGD(TAG, "Set quality to: %d", qs);
    }
    return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
    int ret = 0;
    /*
    ret = write_reg_bits(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR, enable);
    if (ret == 0) {
        sensor->status.colorbar = enable;
        ESP_LOGD(TAG, "Set colorbar to: %d", enable);
    }
    */
   sensor->status.colorbar = enable;
    return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AGC_MANUALEN, !enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set gain_ctrl to: %d", enable);
        sensor->status.agc = enable;
    }
    return ret;
}

static int set_exposure_ctrl(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, AEC_PK_MANUAL, AEC_PK_MANUAL_AEC_MANUALEN, !enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set exposure_ctrl to: %d", enable);
        sensor->status.aec = enable;
    }
    return ret;
}

static int set_whitebal(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, ISP_CONTROL_01, 0x01, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set awb to: %d", enable);
        sensor->status.awb = enable;
    }
    return ret;
}

//Advanced AWB
static int set_dcw_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x5183, 0x80, !enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set dcw to: %d", enable);
        sensor->status.dcw = enable;
    }
    return ret;
}

//night mode enable
static int set_aec2(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x3a00, 0x04, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set aec2 to: %d", enable);
        sensor->status.aec2 = enable;
    }
    return ret;
}

static int set_bpc_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x04, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set bpc to: %d", enable);
        sensor->status.bpc = enable;
    }
    return ret;
}

static int set_wpc_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x02, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set wpc to: %d", enable);
        sensor->status.wpc = enable;
    }
    return ret;
}

//Gamma enable
static int set_raw_gma_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x20, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set raw_gma to: %d", enable);
        sensor->status.raw_gma = enable;
    }
    return ret;
}

static int set_lenc_dsp(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x5000, 0x80, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set lenc to: %d", enable);
        sensor->status.lenc = enable;
    }
    return ret;
}

